## HANA FINTECH LAB - DATA EXTRACTING
1. RETREIVE WEEKLY DATA 
 - (where) exclude : negative payment 
 - revisit_his : addr, card_name, cnt_pay
 - inner join : company_id(co_name, cate, cate1), epopcon_id(latitude1, longitude1)
 * cardname, co_name, addr - refining required
2. MERGE & SUM+GROUP BY 
3. EXPORT AS XML FILE

In [1]:
from sqlalchemy import create_engine
import pymysql, pandas as pd
pymysql.install_as_MySQLdb()
import MySQLdb

### REVISIT HIS DATA - 우선순위 3번째

In [2]:
%%time
engine = create_engine("mysql://eums:eums00!q@133.186.146.142:3306/eums-cj-1-business?charset=utf8mb4",encoding='utf8',pool_size=20,pool_recycle=3600,connect_args={'connect_timeout':1000000})

#EPOPCON_ID,COMPANY_ID,CARD_NAME,PAYMENT

query1 = 'select EPOPCON_ID,COMPANY_ID,CARD_NAME,PAYMENT,DEAL_LOCATION,DEAL_DT,REG_DT from MEUMS_COMP_REVISIT_HIS where PAYMENT > 0 AND DEAL_DT BETWEEN "2018-04-01 00:00:00" AND "2018-04-06 23:59:59";'
query2 = 'select EPOPCON_ID,COMPANY_ID,CARD_NAME,PAYMENT,DEAL_LOCATION,DEAL_DT,REG_DT from MEUMS_COMP_REVISIT_HIS where PAYMENT > 0 AND DEAL_DT BETWEEN "2018-04-07 00:00:00" AND "2018-04-12 23:59:59";'
query3 = 'select EPOPCON_ID,COMPANY_ID,CARD_NAME,PAYMENT,DEAL_LOCATION,DEAL_DT,REG_DT from MEUMS_COMP_REVISIT_HIS where PAYMENT > 0 AND DEAL_DT BETWEEN "2018-04-13 00:00:00" AND "2018-04-18 23:59:59";'
query4 = 'select EPOPCON_ID,COMPANY_ID,CARD_NAME,PAYMENT,DEAL_LOCATION,DEAL_DT,REG_DT from MEUMS_COMP_REVISIT_HIS where PAYMENT > 0 AND DEAL_DT BETWEEN "2018-04-19 00:00:00" AND "2018-04-24 23:59:59";'
query5 = 'select EPOPCON_ID,COMPANY_ID,CARD_NAME,PAYMENT,DEAL_LOCATION,DEAL_DT,REG_DT from MEUMS_COMP_REVISIT_HIS where PAYMENT > 0 AND DEAL_DT BETWEEN "2018-04-25 00:00:00" AND "2018-04-31 23:59:59";'

p1 = pd.read_sql_query(query1,engine)
p1.to_pickle('april_data/revisit_his_p1.pick')

p2 = pd.read_sql_query(query2,engine)
p2.to_pickle('april_data/revisit_his_p2.pick')

p3 = pd.read_sql_query(query3,engine)
p3.to_pickle('april_data/revisit_his_p3.pick')

p4 = pd.read_sql_query(query4,engine)
p4.to_pickle('april_data/revisit_his_p4.pick')

p5 = pd.read_sql_query(query5,engine)
p5.to_pickle('april_data/revisit_his_p5.pick')


print(p1.shape) 
print(p2.shape)
print(p3.shape)
print(p4.shape)
print(p5.shape)

(3470820, 4)
(3506974, 4)
(3565795, 4)
(3597118, 4)
(3788319, 4)

### LIFEZONE  - 우선순위 2번째

In [3]:
%%time
engine = create_engine("mysql://eums:eums00!q@133.186.146.142:3306/eums-cj-1-business?charset=utf8mb4",encoding='utf8',pool_size=20,pool_recycle=3600,connect_args={'connect_timeout':1000000})

query1 = 'select EPOPCON_ID, LATITUDE1, LONGITUDE1 from MEUMS_LATEST_LIFEZONE WHERE EPOPCON_ID IN '+str(tuple(p1.EPOPCON_ID.unique().tolist()))+';'
query2 = 'select EPOPCON_ID, LATITUDE1, LONGITUDE1 from MEUMS_LATEST_LIFEZONE WHERE EPOPCON_ID IN '+str(tuple(p2.EPOPCON_ID.unique().tolist()))+';'
query3 = 'select EPOPCON_ID, LATITUDE1, LONGITUDE1 from MEUMS_LATEST_LIFEZONE WHERE EPOPCON_ID IN '+str(tuple(p3.EPOPCON_ID.unique().tolist()))+';'
query4 = 'select EPOPCON_ID, LATITUDE1, LONGITUDE1 from MEUMS_LATEST_LIFEZONE WHERE EPOPCON_ID IN '+str(tuple(p4.EPOPCON_ID.unique().tolist()))+';'
query5 = 'select EPOPCON_ID, LATITUDE1, LONGITUDE1 from MEUMS_LATEST_LIFEZONE WHERE EPOPCON_ID IN '+str(tuple(p5.EPOPCON_ID.unique().tolist()))+';'

p1_lifezone = pd.read_sql_query(query1,engine)
p2_lifezone = pd.read_sql_query(query2,engine)
p3_lifezone = pd.read_sql_query(query3,engine)
p4_lifezone = pd.read_sql_query(query4,engine)
p5_lifezone = pd.read_sql_query(query5,engine)


# p1 = pd.merge(p1, p1_lifezone, how='inner', on='EPOPCON_ID')[['EPOPCON_ID','COMPANY_ID','CARD_NAME''PAYMENT','LATITUDE1','LONGITUDE1']]
# p2 = pd.merge(p2, p2_lifezone, how='inner', on='EPOPCON_ID')[['EPOPCON_ID','COMPANY_ID','CARD_NAME''PAYMENT','LATITUDE1','LONGITUDE1']]
# p3 = pd.merge(p3, p3_lifezone, how='inner', on='EPOPCON_ID')[['EPOPCON_ID','COMPANY_ID','CARD_NAME''PAYMENT','LATITUDE1','LONGITUDE1']]
# p4 = pd.merge(p4, p4_lifezone, how='inner', on='EPOPCON_ID')[['EPOPCON_ID','COMPANY_ID','CARD_NAME''PAYMENT','LATITUDE1','LONGITUDE1']]
# p5 = pd.merge(p5, p5_lifezone, how='inner', on='EPOPCON_ID')[['EPOPCON_ID','COMPANY_ID','CARD_NAME''PAYMENT','LATITUDE1','LONGITUDE1']]

lifezone = pd.concat([p1_lifezone,p2_lifezone,p3_lifezone,p4_lifezone,p5_lifezone])
lifezone = lifezone.drop_duplicates('EPOPCON_ID')
lifezone.to_pickle('april_data/lifezone.pick')
print(lifezone.shape)

(556677, 3)
Wall time: 1min 42s

### COMPANY INFO  - 우선순위 1번째

In [4]:
%%time
engine = create_engine("mysql://eumsread:eumsread00!q@133.186.143.151:13306/eums-shared?charset=utf8mb4",encoding='utf8',pool_size=20,pool_recycle=3600,connect_args={'connect_timeout':1000000})
# conn = pymysql.connect(host='133.186.143.151', user='eumsread', password='eumsread00!q', db='eums-shared', port=13306,charset='utf8')

p1_company = pd.read_sql_query('select ID AS COMPANY_ID, CO_NAME, CATE,CATE1,ADDR from MEUMS_COMPANY WHERE ID IN '+str(tuple(p1.COMPANY_ID.unique().tolist()))+';',engine) 
p2_company = pd.read_sql_query('select ID AS COMPANY_ID, CO_NAME, CATE,CATE1,ADDR from MEUMS_COMPANY WHERE ID IN '+str(tuple(p2.COMPANY_ID.unique().tolist()))+';',engine) 
p3_company = pd.read_sql_query('select ID AS COMPANY_ID, CO_NAME, CATE,CATE1,ADDR from MEUMS_COMPANY WHERE ID IN '+str(tuple(p3.COMPANY_ID.unique().tolist()))+';',engine) 
p4_company = pd.read_sql_query('select ID AS COMPANY_ID, CO_NAME, CATE,CATE1,ADDR from MEUMS_COMPANY WHERE ID IN '+str(tuple(p4.COMPANY_ID.unique().tolist()))+';',engine) 
p5_company = pd.read_sql_query('select ID AS COMPANY_ID, CO_NAME, CATE,CATE1,ADDR from MEUMS_COMPANY WHERE ID IN '+str(tuple(p5.COMPANY_ID.unique().tolist()))+';',engine) 

company = pd.concat([p1_company,p2_company,p3_company,p4_company,p5_company])
company = company.drop_duplicates('COMPANY_ID')
# company.to_pickle('april_data/company.pick')
print(company.shape)

(910106, 5)
Wall time: 53.1 s

In [5]:
# COMPANY NAME, ADDR 정제
def cleanChar(sentence):
    import re
    pattern = re.compile(r'\s{0,2}\&amp\;\s{0,2}')
    sentence = re.sub(pattern,'@',sentence)
    pattern = re.compile(r'\s{0,2}\&.{2,4}\;\s{0,2}|\<|\>|\'|\"')
    sentence = re.sub(pattern,'',sentence)
    pattern = re.compile(r'\&')
    sentence = re.sub(pattern,'@',sentence)
    return sentence


company[['ADDR','CO_NAME']]=company[['ADDR','CO_NAME']].applymap(cleanChar)
print(company.shape)

(910106, 5)

In [6]:
def refineHana(data):
    print('total: ', data.shape)
    
    #화장실제거
    test0 = data[~data['CO_NAME'].str.contains('화장실')]
    print('nonRestroom: ',test0.shape)
    test = data[data['CO_NAME'].str.contains('화장실')]  
    print('Restroom: ',test.shape)
    
    #1
    test_public = test[test['CATE']=='공공']  
    
    print('Restroom-public: ',test_public.shape)    
    etc = test_public[~test_public['CO_NAME'].str.contains('주유소|충전소|가스|병원|수련관|복지관')]
    a = test_public[test_public['CO_NAME'].str.contains('주유소')].assign(CATE = '교통', CATE1 = '주유소')
    b = test_public[test_public['CO_NAME'].str.contains('충전소|가스')].assign(CATE = '교통', CATE1 = '충전소')
    c = test_public[test_public['CO_NAME'].str.contains('병원')].assign(CATE = '의료/건강', CATE1 = '병원')
    d = test_public[test_public['CO_NAME'].str.contains('수련관')].assign(CATE = '교육', CATE1 = '수련원')
    e = test_public[test_public['CO_NAME'].str.contains('복지관')].assign(CATE = '공공', CATE1 = '사회복지시설')
    test_public = etc.append([a,b,c,d,e])
    
    print('after Restroom-public: ',test_public.shape)    
    test_public=test_public.assign(CO_NAME=test_public['CO_NAME'].str.replace('공중화장실','')) #460
    test_public=test_public.assign(CO_NAME=test_public['CO_NAME'].str.replace('개방화장실',''))#1157
    test_public=test_public.assign(CO_NAME=test_public['CO_NAME'].str.replace('화장실',''))#20 - 충전소 화장실, 협동조합 화장실
    # A=A.assign(CO_NAME=A['CO_NAME'].str.replace('공중화장실',''))
    
    #2
    test_nonPublic = test[test['CATE']!='공공']
    print('Restroom-nonPublic: ',test_nonPublic.shape)
    test_nonPublic=test_nonPublic.assign(CO_NAME=test_nonPublic['CO_NAME'].str.replace('공중화장실','')) #460
    test_nonPublic=test_nonPublic.assign(CO_NAME=test_nonPublic['CO_NAME'].str.replace('개방화장실',''))#1157
    test_nonPublic=test_nonPublic.assign(CO_NAME=test_nonPublic['CO_NAME'].str.replace('화장실',''))#20 - 충전소 화장실, 협동조합 화장실
    # test_nonPublic.CO_NAME=test_nonPublic['CO_NAME'].str.replace('공중화장실','') #460
    print('after Restroom-nonPublic: ',test_nonPublic.shape)
    
    #3
    temp = test_public.append(test_nonPublic)
    print('check Restroom: ',temp.shape)
    
#     temp.append(test0).sort_values(by=['EPOPCON_ID','COMPANY_ID','CARD_NAME'], axis=0)
    print('check total: ',temp.append(test0).shape)
    return  temp.append(test0)


company = refineHana(company)
print(company.shape)
company.to_pickle('april_data/company.pick')

total:  (910106, 5)
nonRestroom:  (910040, 5)
Restroom:  (66, 5)
Restroom-public:  (26, 5)
after Restroom-public:  (26, 5)
Restroom-nonPublic:  (40, 5)
after Restroom-nonPublic:  (40, 5)
check Restroom:  (66, 5)
check total:  (910106, 5)
(910106, 5)

### MERGE DATA + CLEAN(CARD_NAME/COMPANY_NAME/ADDR)

In [7]:
p = pd.concat([p1,p2,p3,p4,p5])
print(p.shape) 

#1.  CARD_NAME 정제 
#a.find('(')
def cleanData(sentence):
    import re
    pattern = re.compile(r'\(.{0,4}\)|RE\)|\<현장즉시결제\>|\[|\s|카드|\<|\>|\'|\"')
    sentence = re.sub(pattern,'',sentence)
    return sentence # return 안쓰면 none값 뜬다.
    
p = p.assign( CARD_NAME = p['CARD_NAME'].apply(cleanData) )
p.to_pickle('april_data/cardname_clean.pick')
p.head(3)

(17929026, 4)

                       EPOPCON_ID  COMPANY_ID CARD_NAME PAYMENT
0  cjcis15a3df9fce946d90511ca0dd6     6107601      경남BC    8000
1  cjcis15a539a990200ba077c8ba8a9     5233223      KB국민   34780
2  cjcis15a3a4abd71e427692251ca77     5233223        롯데  437976

company= pd.read_pickle('april_data/company.pick')
lifezone= pd.read_pickle('april_data/lifezone.pick')
p= pd.read_pickle('april_data/cardname_clean.pick')
p.head(2)

### payment type 변환

In [8]:
p['PAYMENT']= p['PAYMENT'].astype(float)
p.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 17929026 entries, 0 to 3788318
Data columns (total 4 columns):
EPOPCON_ID    object
COMPANY_ID    int64
CARD_NAME     object
PAYMENT       float64
dtypes: float64(1), int64(1), object(2)
memory usage: 683.9+ MB

p.groupby(['EPOPCON_ID','COMPANY_ID','CARD_NAME']).head()

### SUM/GROUP_BY + RENAME_COLUMNS

 - 전체 column 기준 groupby
 - p_group = p.groupby(['EPOPCON_ID','COMPANY_ID','CARD_NAME']).agg({'CNT_PAY':'sum','SUM_PAY':'sum'}).reset_index()
 - http://pinkwink.kr/977

In [9]:
# df = data.groupby('Seed').agg(
#     {'age':['sum'],
#      'height':['mean', 'std']})
# p_group.columns = ["_".join(x) for x in p_group.columns.ravel()]

p_group = p.groupby(['EPOPCON_ID','COMPANY_ID','CARD_NAME']).agg(['count','sum']).reset_index()
p_group.columns = ["_".join(x) for x in p_group.columns.ravel()]

print(p_group.shape) # (12266736, 5) -> 12265619 감소 (카드이름으로 더 많이 묶임)
p_group.head()

(11935155, 5)

,EPOPCON_ID_,COMPANY_ID_,CARD_NAME_,PAYMENT_count,PAYMENT_sum
0,cjcis15a0c273a71e42706814f6329,1001701,신한,1,12600.0
1,cjcis15a0c273a71e42706814f6329,4984806,삼성,1,17370.0
2,cjcis15a0c273a71e42706814f6329,6077000,삼성,1,700.0
3,cjcis15a0c273a71e42706814f6329,6999903,삼성,1,178910.0
4,cjcis15a0c273a71e42706814f6329,8272707,삼성,1,6900.0

In [10]:
import gc
gc.collect()
del p
p_group.columns = ['EPOPCON_ID','COMPANY_ID','CARD_NAME','CNT_PAY','SUM_PAY'] 
p_group.head()

                       EPOPCON_ID  COMPANY_ID CARD_NAME  CNT_PAY   SUM_PAY
0  cjcis15a0c273a71e42706814f6329     1001701        신한        1   12600.0
1  cjcis15a0c273a71e42706814f6329     4984806        삼성        1   17370.0
2  cjcis15a0c273a71e42706814f6329     6077000        삼성        1     700.0
3  cjcis15a0c273a71e42706814f6329     6999903        삼성        1  178910.0
4  cjcis15a0c273a71e42706814f6329     8272707        삼성        1    6900.0

### JOIN

In [11]:
p = pd.merge(p_group,company, how='inner', on='COMPANY_ID')
p = pd.merge(p,lifezone, how='inner', on='EPOPCON_ID')

# EPOPCON_ID 정제
# p = p.assign( EPOPCON_ID = p['EPOPCON_ID'].apply(lambda x : x.replace('cjcis','')) )
print(p.shape)
p.head()

(10078162, 11)

,EPOPCON_ID,COMPANY_ID,CARD_NAME,CNT_PAY,SUM_PAY,CO_NAME,CATE,CATE1,ADDR,LATITUDE1,LONGITUDE1
0,cjcis15a0c273a71e42706814f6329,1001701,신한,1,12600.0,한결한의원,의료/건강,병원,서울 마포구 망원동 517,37.606406,127.04041
1,cjcis15a0c273a71e42706814f6329,4984806,삼성,1,17370.0,LG유플러스(LG U+),통신,대리점,서울특별시 용산구 한강로3가 65-228,37.606406,127.04041
2,cjcis15a0c273a71e42706814f6329,6077000,삼성,1,700.0,롯데칠성음료충정대리점,카페/디저트,음료,서울특별시 마포구 토정동 3-31,37.606406,127.04041
3,cjcis15a0c273a71e42706814f6329,6999903,삼성,1,178910.0,대륜이엔에스 노원5고객센터,주거,가스,서울 노원구 공릉동 415-65,37.606406,127.04041
4,cjcis15a0c273a71e42706814f6329,8272707,삼성,1,6900.0,워너비박스 서여의도점,외식,도시락,서울 영등포구 여의도동 17-9 더하우스소호 지하1층 110호,37.606406,127.04041

### epopcon_id에서 cjcis 문자제거하기

In [12]:
# EPOPCON_ID 정제
p = p.assign( EPOPCON_ID = p['EPOPCON_ID'].apply(lambda x : x.replace('cjcis','')) )
print(p.shape)
p.head()

(10078162, 11)

,EPOPCON_ID,COMPANY_ID,CARD_NAME,CNT_PAY,SUM_PAY,CO_NAME,CATE,CATE1,ADDR,LATITUDE1,LONGITUDE1
0,15a0c273a71e42706814f6329,1001701,신한,1,12600.0,한결한의원,의료/건강,병원,서울 마포구 망원동 517,37.606406,127.04041
1,15a0c273a71e42706814f6329,4984806,삼성,1,17370.0,LG유플러스(LG U+),통신,대리점,서울특별시 용산구 한강로3가 65-228,37.606406,127.04041
2,15a0c273a71e42706814f6329,6077000,삼성,1,700.0,롯데칠성음료충정대리점,카페/디저트,음료,서울특별시 마포구 토정동 3-31,37.606406,127.04041
3,15a0c273a71e42706814f6329,6999903,삼성,1,178910.0,대륜이엔에스 노원5고객센터,주거,가스,서울 노원구 공릉동 415-65,37.606406,127.04041
4,15a0c273a71e42706814f6329,8272707,삼성,1,6900.0,워너비박스 서여의도점,외식,도시락,서울 영등포구 여의도동 17-9 더하우스소호 지하1층 110호,37.606406,127.04041

In [2]:
# p.to_pickle('april_data/hana_april.pick')

p = pd.read_pickle('april_data/hana_april.pick')

### EXPORT XML FILE 

- UnicodeDecode Error : illegal multibyte sequence

p=p.replace('\\xa0', '')  ->  with open(filename, mode, encoding='utf8') as f:

In [4]:
#https://stackoverflow.com/questions/18574108/how-do-convert-a-pandas-dataframe-to-xml

def to_xml(df, filename=None, mode='w'):
    bigxml=['<?xml version="1.0"?>','<resultset xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">']
    def row_to_xml(row):
        xml = [' <row>']
        for i, col_name in enumerate(row.index):
            xml.append('  <field name="{0}">{1}</field>'.format(col_name, row.iloc[i]))
        xml.append(' </row>')
        return '\n'.join(xml)
    resultset = '\n'.join(df.apply(row_to_xml, axis=1))
    bigxml.append(resultset)
    bigxml.append('</resultset>')
    res = '\n'.join(bigxml)
    
    if filename is None:
        return res
    with open(filename, mode, encoding='utf8') as f:
        f.write(res)

pd.DataFrame.to_xml = to_xml

#tmp.to_xml('test.csv')
# p.iloc[:2500000,].to_xml('april_data/hana_april1.xml')
# p.iloc[2500000:5000000,].to_xml('april_data/hana_april2.xml')
# p.iloc[5000000:7500000,].to_xml('april_data/hana_april3.xml')
p.iloc[7500000:,].to_xml('april_data/hana_april4.xml')

In [10]:
p.iloc[1006946:,].head()

,EPOPCON_ID,COMPANY_ID,CARD_NAME,CNT_PAY,SUM_PAY,ADDR,CATE,CATE1,CO_NAME,LATITUDE1,LONGITUDE1
1006946,15a3991ec71e42756fbe86b6e,30188,KB국민,1,9200.0,경기도 수원시 장안구 정자동 535-12,마트,편의점,CU 청솔번영점,37.2985548,126.9872756
1006947,15a3991ec71e42756fbe86b6e,8077641,KB국민체크,1,7400.0,경기 수원시 장안구 천천동 527-1,마트,시장,장독대천천동점,37.2985548,126.9872756
1006948,15a3991ec71e42756fbe86b6e,7486252,KB국민,1,5100.0,경기도 수원시 장안구 정자동 877-4 정연메이져 1층,카페/디저트,베이커리,뚜레쥬르수원정자점,37.2985548,126.9872756
1006949,15a3991ec71e42756fbe86b6e,5256211,KB국민,1,2200.0,,뷰티,화장품,올리브영 수원천천점,37.2985548,126.9872756
1006950,15a3991ec71e42756fbe86b6e,5256211,KB국민체크,1,6210.0,,뷰티,화장품,올리브영 수원천천점,37.2985548,126.9872756

In [16]:
print(p[p['CO_NAME'].str.contains('\&|\<|\>|\'|\"')].shape)
print(p[p['CO_NAME'].str.contains('화장실')].shape)

(0, 11)

In [17]:
p[p['ADDR'].str.contains('&|<|>|\'|"')].shape
p[p['ADDR'].str.contains('@')].shape
p[p['ADDR'].str.contains('@')].head()

,EPOPCON_ID,COMPANY_ID,CARD_NAME,CNT_PAY,SUM_PAY,CO_NAME,CATE,CATE1,ADDR,LATITUDE1,LONGITUDE1
7813,15a38c4da71e42756fbe6acf3,331209,롯데,1,1400.0,맥도날드 중앙대점,외식,패스트푸드,서울 동작구 흑석동 221 중앙대학교 약학대학 R@D센터 지하1층,37.583560,127.049909
8300,15a38c60de946d9170e4ac3ab,24010,KB국민,2,35000.0,CGV 인천점,문화,영화,인천 남동구 구월동 1130 SEE@SEEE빌딩 4층,37.540170,126.734375
8445,15a38c6516259ad0a9e318a81,1059333,신한BC,1,58000.0,호수세탁소,생활,,경기도 고양시 일산동구 장항동 875 호수4단지 LG@롯데아파트 상가,37.651921,126.775700
9280,15a38c7ec6259ad0a9e318c65,147219,KB국민,1,3600.0,김기택내과의원,의료/건강,병원,경기 김포시 장기동 494-31 C@C빌딩 5층~7층,37.505473,127.037884
12863,15a38cf52e946d9170e4acaa3,24010,KB국민,1,19000.0,CGV 인천점,문화,영화,인천 남동구 구월동 1130 SEE@SEEE빌딩 4층,37.468214,126.645818

In [7]:
print(p[p['ADDR'].str.contains('["\'&<>]')].shape)
print(p[p['CO_NAME'].str.contains('["\'&<>]')].shape)
print(p[p['CO_NAME'].str.contains('화장실')].shape)
p[p['CARD_NAME'].str.contains('["\'&<>]')].shape

(0, 11)
(0, 11)
(0, 11)

(0, 11)

In [6]:
p[p['ADDR'].str.contains('["\'#&<>]')].head()

,EPOPCON_ID,COMPANY_ID,CARD_NAME,CNT_PAY,SUM_PAY,CO_NAME,CATE,CATE1,ADDR,LATITUDE1,LONGITUDE1
8886,15a38c74e6259ad0a9e318b8b,7691644,삼성,1,64968.0,AGODA,여행,숙박,"30 Cecil Street, Prudential Tower #19-08, Sing...",37.204112,127.061057
9253,15a38c7ec6259ad0a9e318c65,7691644,KB국민,1,83082.0,AGODA,여행,숙박,"30 Cecil Street, Prudential Tower #19-08, Sing...",37.505473,127.037884
14487,15a38d1a3e946d9170e4acc44,7691644,SC은행BC,3,880982.0,AGODA,여행,숙박,"30 Cecil Street, Prudential Tower #19-08, Sing...",37.566703,126.978313
15609,15a38d365e946d9170e4ace56,7691644,신한,2,341999.0,AGODA,여행,숙박,"30 Cecil Street, Prudential Tower #19-08, Sing...",37.500572,127.037400
23565,15a38dc40e946d9170e4adca6,7691644,하나,1,1140.0,AGODA,여행,숙박,"30 Cecil Street, Prudential Tower #19-08, Sing...",37.638295,126.877622

4월 데이터(HANA)
총 데이터수 : 10,078,162 
사용자수 : 556,677 
상점수 : 846,964 

http://115.90.182.250:19080/public/hana/hana4.zip
121.134.237.63

In [6]:
len(p.COMPANY_ID.unique())

846964